<template>
  <section class="articles">
    <div class="container">
      <h1>Статьи</h1>
      <div class="articles__flex">
        <ArticlesItem
          v-for="(article, index) in articles"
          :key="index"
          :title="article.title"
          :desc-short="article.descShort"
          :slug="article.slug"
        />
      </div>
    </div>
  </section>
</template>
<script>
export default {
  name: 'ArticlesList',
  data () {
    return {
      articles: [
        {
          title: 'Механическая клавиатура или мембранная?',
          descShort: 'Расскажем кратко про основные отличия механической конструкции от мембранной, чтобы вы поняли, о чем идет речь',
          descFull: 'Расскажем кратко про основные отличия механической конструкции от мембранной, чтобы вы поняли, о чем идет речь. Расскажем кратко про основные отличия механической конструкции от мембранной, чтобы вы поняли, о чем идет речь. Расскажем кратко про основные отличия механической конструкции от мембранной, чтобы вы поняли, о чем идет речь',
          slug: 'article1'
        },
        {
          title: 'Какую механическую клавиатуру выбрать?',
          descShort: 'Мы расскажем, как не потратить свои деньги впустую на клавиатуру, которая вам не подойдет',
          descFull: 'Мы расскажем, как не потратить свои деньги впустую на клавиатуру, которая вам не подойдет. Мы расскажем, как не потратить свои деньги впустую на клавиатуру, которая вам не подойдет. Мы расскажем, как не потратить свои деньги впустую на клавиатуру, которая вам не подойдет',
          slug: 'article2'
        },
        {
          title: 'Почему не стоит покупать механическую клавиатуру на Aliexpress?',
          descShort: 'Давайте разберемся, что это за зверь такой — клавиатуры с AliExpress, и есть ли смысл их покупать',
          descFull: 'Давайте разберемся, что это за зверь такой — клавиатуры с AliExpress, и есть ли смысл их покупать. Давайте разберемся, что это за зверь такой — клавиатуры с AliExpress, и есть ли смысл их покупать. Давайте разберемся, что это за зверь такой — клавиатуры с AliExpress, и есть ли смысл их покупать',
          slug: 'article3'
        },
        {
          title: 'Уход за механической клавиатурой',
          descShort: 'Расскажем, как правильно ухаживать за вашими клавками',
          descFull: 'Расскажем, как правильно ухаживать за вашими клавками. Расскажем, как правильно ухаживать за вашими клавками. Расскажем, как правильно ухаживать за вашими клавками',
          slug: 'article4'
        },
        {
          title: 'Крепления переключателей: Plate Mounted и PCB Mounted',
          descShort: 'Переключатели обычно крепятся на клавиатуру одним из двух популярных способов: Plate Mounted и PCB Mounted',
          descFull: 'Переключатели обычно крепятся на клавиатуру одним из двух популярных способов: Plate Mounted и PCB Mounted. Переключатели обычно крепятся на клавиатуру одним из двух популярных способов: Plate Mounted и PCB Mounted. Переключатели обычно крепятся на клавиатуру одним из двух популярных способов: Plate Mounted и PCB Mounted',
          slug: 'article5'
        },
        {
          title: 'Виды нанесения символов на клавиши',
          descShort: 'Doubleshot, Dye Sublimation, Laser Engraving и Pad Printing. Если эти слова вам не знакомы, то давайте разберемся, в чем мем. Doubleshot, Dye Sublimation, Laser Engraving и Pad Printing',
          descFull: 'Если эти слова вам не знакомы, то давайте разберемся, в чем мем. Doubleshot, Dye Sublimation, Laser Engraving и Pad Printing. Если эти слова вам не знакомы, то давайте разберемся, в чем мем. Если эти слова вам не знакомы, то давайте разберемся, в чем мем. Doubleshot, Dye Sublimation, Laser Engraving и Pad Printing. Если эти слова вам не знакомы, то давайте разберемся, в чем мем',
          slug: 'article6'
        },
        {
          title: 'Чем отличается дорогая клавиатура от дешевой?',
          descShort: 'Статья о том, почему при выборе механической клавиатуры не стоит экономить свои кровные',
          descFull: 'Статья о том, почему при выборе механической клавиатуры не стоит экономить свои кровные. Статья о том, почему при выборе механической клавиатуры не стоит экономить свои кровные. Статья о том, почему при выборе механической клавиатуры не стоит экономить свои кровные',
          slug: 'article7'
        },
        {
          title: 'Типы механических переключателей',
          descShort: 'В этой статье вы узнаете все (или почти) о механических переключателях, различия между ними и какие компании их производят',
          descFull: 'В этой статье вы узнаете все (или почти) о механических переключателях, различия между ними и какие компании их производят. В этой статье вы узнаете все (или почти) о механических переключателях, различия между ними и какие компании их производят. В этой статье вы узнаете все (или почти) о механических переключателях, различия между ними и какие компании их производят',
          slug: 'article8'
        }
      ]
    }
  }
}
</script>
<style lang="scss" scoped>
.articles {
  margin: 50px 0 70px;
  h1 {
    text-align: left;
  }
  &__flex {
    margin: 30px -20px 0;
    display: flex;
    justify-content: flex-start;
    align-items: flex-start;
    flex-wrap: wrap;
  }
}

@media screen and (max-width: 1020px) {
  .articles {
    &__flex {
      margin-right: -10px;
      margin-left: -10px;
    }
  }
}
</style>
